{
  "education": [
    {
      "awards_achievements": [
        "Graduated with Honours",
        "Dean's List (2020, 2021)",
        "GPA: 3.7/4.0"
      ],
      "degree": "Bachelor of Computer Science",
      "department": "Computer Programming",
      "duration": "2019-2021",
      "school_name": "Algonquin College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KarenLauzon",
  "highlighted_projects": [
    {
      "description": "Created an application that takes a users input of latitude and longitude and displays the google earth image at that location. Project used APi, Java, Android emulators, and HTML.",
      "git_url": "https://github.com/lauz0160/FinalProject",
      "name": "Android application for finding google earth images"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a tool that grabs computers hardware and usage information and sends the information to a database. This tool is implemented on a cluster system to get details of the efficiency of each node in the cluster. The project uses Java, crontabs, bash, scripts, and postgresql.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": [
        "Twitter CRUD App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Spring RESTful Microservices App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Karen Lauzon",
  "others": [
    {
      "bullets": [
        "    "
      ],
      "title": "  "
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Develops projects using java, Linux, Bash, Databases, SQL, and Git. The requirements and purpose of the projects are defined by the client needs and a solution is formed, developed, and implemented.",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "RCMP Help Desk",
      "description": "Utilized tools and basic troubleshooting skills to assist clients in problem solving their software and hardware issues remotely. Explained solutions to clients in non technical, easy to follow instructions.",
      "duration": "2020-2021",
      "title": "Co-op Level 1 Analyst"
    }
  ],
  "skills": {
    "competent": [
      "Eclipse/IDE",
      "SDLC",
      "Python",
      "HTML/CSS",
      "Android Studios"
    ],
    "familiar": [
      "COBOL",
      "Wireshark",
      "Maven",
      "Hardware/Software Troubleshooting",
      "AutoCAD"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I was a computer Programming student at Algonquin College, we learned a wide spread of basic computer knowledge as well as studied the more common programming languages and completed many projects using these skills. I enjoy all things computer and technology-related, however, I have not had much experience in a professional environment. I have taken optional courses in programming and computer science since I was in high school where I put my problem-solving abilities to use building computer games. I started at Carleton University before realizing that the courses that captured my attention were computer-based ones, and I have been looking to improve my skills in the field ever since."
}
